## Gen AI Student-Class-Subject-TestMarks Project with Grok

### Overview
- In backend REST api development to view resource we need to create LIST and VIEW API for each resource i.e. 4x2= 8 api's for 4 resource and if we add more then we need develope those also mannually hard coding.

- Inside all those api we are just changing the SQL queries to fetch data from different tables. 

- For any kind of aggregate oparation we need to create those functions mannually.

<b>LMM Comes to picture</b>

- With AI LMM models we can now solve that problem by generating dynamic SQL queries on the fly and excute those to db and get ideal data.


### Goals

Create a prompt API where we will ask question and it will query the DB and return response as json

## Project Architecture
#### Student Schema -

```
first_name
last_name
gender
dob
age
class_id
```

#### Class Schema -

```
name
status

```

#### Subject Schema -

```
name
class_id
description

```

#### Test Marks Schema - 

```
name
class_id
student_id
subject_id
marks
totalMarks
```


Relationship - 
1. Stundent Belongs to one Class
2. One Class has multiple Subjects
3. One Class has multiple Students
4. One Student has marks for every subject


### Goals

Create a prompt API where we will ask question and it will query the DB and return response as json

#### Example

 a. Profile Information of Student name John. Expecting class info and its subjects and marks if exist

 b. Class marks report for Student name John

 c. Get all students of Subject Physic

In [1]:
print("hello world")

hello world

In [2]:
!uv pip install psycopg2-binary sqlalchemy pandas python-dotenv flask

Using Python 3.12.3 environment at: /home/hp/Documents/Vscode/gen_ai_students_marksheet/venv
Audited 5 packages in 7ms

In [3]:
from sqlalchemy import create_engine, Column, Integer, String, Date, ForeignKey, text
from sqlalchemy.orm import declarative_base
from sqlalchemy.orm import sessionmaker, relationship
from datetime import date

# Panda
import pandas as pd

# Dotenv
from dotenv import load_dotenv
import os

# Random
import random


# Load environment variables from .env file
load_dotenv()

True

In [4]:
# Database connection
DATABASE_URL = os.getenv("DATABASE_URL")
print(f"Connecting to database at: {DATABASE_URL}")

Connecting to database at: postgresql://postgres:postgres@localhost:5432/gen_ai_db

In [5]:

engine = create_engine(DATABASE_URL)
Base = declarative_base()

# Define models
class Class(Base):
    __tablename__ = 'classes'
    
    id = Column(Integer, primary_key=True)
    name = Column(String(100), nullable=False)
    status = Column(String(50))
    
    students = relationship("Student", back_populates="class_")
    subjects = relationship("Subject", back_populates="class_")
    test_marks = relationship("TestMarks", back_populates="class_")

class Student(Base):
    __tablename__ = 'students'
    
    id = Column(Integer, primary_key=True)
    first_name = Column(String(100), nullable=False)
    last_name = Column(String(100), nullable=False)
    gender = Column(String(10))
    dob = Column(Date)
    age = Column(Integer)
    class_id = Column(Integer, ForeignKey('classes.id'))
    
    class_ = relationship("Class", back_populates="students")
    test_marks = relationship("TestMarks", back_populates="student")

class Subject(Base):
    __tablename__ = 'subjects'
    
    id = Column(Integer, primary_key=True)
    name = Column(String(100), nullable=False)
    class_id = Column(Integer, ForeignKey('classes.id'))
    description = Column(String(500))
    
    class_ = relationship("Class", back_populates="subjects")
    test_marks = relationship("TestMarks", back_populates="subject")

class TestMarks(Base):
    __tablename__ = 'test_marks'
    
    id = Column(Integer, primary_key=True)
    name = Column(String(100), nullable=False)
    class_id = Column(Integer, ForeignKey('classes.id'))
    student_id = Column(Integer, ForeignKey('students.id'))
    subject_id = Column(Integer, ForeignKey('subjects.id'))
    marks = Column(Integer)
    total_marks = Column(Integer)
    
    class_ = relationship("Class", back_populates="test_marks")
    student = relationship("Student", back_populates="test_marks")
    subject = relationship("Subject", back_populates="test_marks")


# Drop all tables
Base.metadata.drop_all(engine)
print("All tables dropped successfully!")

# Recreate tables if needed
Base.metadata.create_all(engine)
print("All tables created successfully!")

# Create session
Session = sessionmaker(bind=engine)
session = Session()

print("Database connected and session created!")

All tables dropped successfully!
All tables created successfully!
Database connected and session created!

## Create demo data

In [6]:

# Create Classes
class_five = Class(name="Five", status="active")
class_six = Class(name="Six", status="active")
class_seven = Class(name="Seven", status="active")

session.add_all([class_five, class_six, class_seven])
session.commit()
print(f"Created 3 classes")


## Alternative way to create multiple classes with RAW SQL data

Created 3 classes

In [7]:
# Create Students
students_data = [
    # Class Five students
    Student(first_name="John", last_name="Doe", gender="M", dob=date(2012, 5, 15), age=12, class_id=class_five.id),
    Student(first_name="Priya", last_name="Sharma", gender="F", dob=date(2012, 11, 25), age=11, class_id=class_five.id),
    Student(first_name="Amit", last_name="Verma", gender="M", dob=date(2012, 2, 10), age=12, class_id=class_five.id),
    Student(first_name="Sara", last_name="Ali", gender="F", dob=date(2012, 7, 19), age=12, class_id=class_five.id),
    Student(first_name="Ravi", last_name="Singh", gender="M", dob=date(2012, 9, 5), age=12, class_id=class_five.id),
    Student(first_name="Neha", last_name="Patel", gender="F", dob=date(2012, 4, 22), age=12, class_id=class_five.id),
    Student(first_name="Vikas", last_name="Gupta", gender="M", dob=date(2012, 3, 30), age=12, class_id=class_five.id),
    Student(first_name="Anjali", last_name="Mehra", gender="F", dob=date(2012, 6, 14), age=12, class_id=class_five.id),

    # Class Six students
    Student(first_name="Ram", last_name="Kumar", gender="M", dob=date(2011, 8, 20), age=13, class_id=class_six.id),
    Student(first_name="Mike", last_name="Johnson", gender="M", dob=date(2011, 6, 30), age=13, class_id=class_six.id),
    Student(first_name="Sonia", last_name="Reddy", gender="F", dob=date(2011, 1, 12), age=13, class_id=class_six.id),
    Student(first_name="Arjun", last_name="Yadav", gender="M", dob=date(2011, 10, 8), age=13, class_id=class_six.id),
    Student(first_name="Pooja", last_name="Chopra", gender="F", dob=date(2011, 5, 17), age=13, class_id=class_six.id),
    Student(first_name="Deepak", last_name="Shah", gender="M", dob=date(2011, 3, 25), age=13, class_id=class_six.id),
    Student(first_name="Meena", last_name="Joshi", gender="F", dob=date(2011, 12, 2), age=13, class_id=class_six.id),
    Student(first_name="Kabir", last_name="Malik", gender="M", dob=date(2011, 7, 21), age=13, class_id=class_six.id),

    # Class Seven students
    Student(first_name="Alice", last_name="Smith", gender="F", dob=date(2010, 3, 10), age=14, class_id=class_seven.id),
    Student(first_name="Rohit", last_name="Bansal", gender="M", dob=date(2010, 8, 13), age=14, class_id=class_seven.id),
    Student(first_name="Simran", last_name="Kaur", gender="F", dob=date(2010, 2, 28), age=14, class_id=class_seven.id),
    Student(first_name="Nikhil", last_name="Agarwal", gender="M", dob=date(2010, 6, 6), age=14, class_id=class_seven.id),
    Student(first_name="Tina", last_name="Kapoor", gender="F", dob=date(2010, 11, 9), age=14, class_id=class_seven.id),
    Student(first_name="Rahul", last_name="Saxena", gender="M", dob=date(2010, 5, 18), age=14, class_id=class_seven.id),
    Student(first_name="Sneha", last_name="Desai", gender="F", dob=date(2010, 9, 27), age=14, class_id=class_seven.id),
    Student(first_name="Vivek", last_name="Chawla", gender="M", dob=date(2010, 4, 3), age=14, class_id=class_seven.id),
]

session.add_all(students_data)
session.commit()
print(f"Created {len(students_data)} students")

Created 24 students

In [8]:
# Create Subjects for each class
subject_names = ["Math", "Physic", "Chemistry", "Biology", "Geography"]
classes = [class_five, class_six, class_seven]

for cls in classes:
    for subject_name in subject_names:
        subject = Subject(
            name=f"{subject_name} {cls.name}",
            class_id=cls.id,
            description=f"{subject_name} subject for class {cls.name}"
        )
        session.add(subject)

session.commit()
print(f"Created {len(subject_names) * len(classes)} subjects")

Created 15 subjects

In [9]:

# Create TestMarks entries with null marks for each student and their class subjects
all_students = session.query(Student).all()

for student in all_students:
    class_subjects = session.query(Subject).filter(Subject.class_id == student.class_id).all()
    for subject in class_subjects:
        test_mark = TestMarks(
            name=f"{subject.name}",
            class_id=student.class_id,
            student_id=student.id,
            subject_id=subject.id,
            marks=random.randint(50, 99),
            total_marks=100
        )
        session.add(test_mark)

session.commit()
print(f"Created test marks entries for all students")

Created test marks entries for all students

### Panda Dataframe
Convert to pandas DataFrame

In [10]:
# Fetch data directly into DataFrame
df_classes = pd.read_sql("SELECT * FROM classes", engine)
print(df_classes)

   id   name  status
0   1   Five  active
1   2    Six  active
2   3  Seven  active

In [11]:
df_students = pd.read_sql("SELECT * FROM students", engine)
print(df_students)

    id first_name last_name gender         dob  age  class_id
0    1       John       Doe      M  2012-05-15   12         1
1    2      Priya    Sharma      F  2012-11-25   11         1
2    3       Amit     Verma      M  2012-02-10   12         1
3    4       Sara       Ali      F  2012-07-19   12         1
4    5       Ravi     Singh      M  2012-09-05   12         1
5    6       Neha     Patel      F  2012-04-22   12         1
6    7      Vikas     Gupta      M  2012-03-30   12         1
7    8     Anjali     Mehra      F  2012-06-14   12         1
8    9        Ram     Kumar      M  2011-08-20   13         2
9   10       Mike   Johnson      M  2011-06-30   13         2
10  11      Sonia     Reddy      F  2011-01-12   13         2
11  12      Arjun     Yadav      M  2011-10-08   13         2
12  13      Pooja    Chopra      F  2011-05-17   13         2
13  14     Deepak      Shah      M  2011-03-25   13         2
14  15      Meena     Joshi      F  2011-12-02   13         2
15  16      Kabir     Malik      M  2011-07-21   13         2
16  17      Alice     Smith      F  2010-03-10   14         3
17  18      Rohit    Bansal      M  2010-08-13   14         3
18  19     Simran      Kaur      F  2010-02-28   14         3
19  20     Nikhil   Agarwal      M  2010-06-06   14         3
20  21       Tina    Kapoor      F  2010-11-09   14         3
21  22      Rahul    Saxena      M  2010-05-18   14         3
22  23      Sneha     Desai      F  2010-09-27   14         3
23  24      Vivek    Chawla      M  2010-04-03   14         3

In [12]:

# With parameters
query = "SELECT * FROM students WHERE class_id = :class_id"
df = pd.read_sql(text(query), engine, params={"class_id": 1})
print(df)

   id first_name last_name gender         dob  age  class_id
0   1       John       Doe      M  2012-05-15   12         1
1   2      Priya    Sharma      F  2012-11-25   11         1
2   3       Amit     Verma      M  2012-02-10   12         1
3   4       Sara       Ali      F  2012-07-19   12         1
4   5       Ravi     Singh      M  2012-09-05   12         1
5   6       Neha     Patel      F  2012-04-22   12         1
6   7      Vikas     Gupta      M  2012-03-30   12         1
7   8     Anjali     Mehra      F  2012-06-14   12         1

## With GenAI
 
- Now with the help of GenAI we can ask AI model to generate SQL for our resouce and execute the query, we do not to need to mannually code for each service

- This is very usefull if have ```n``` number of resources, just by defineing the Database schema and their relationship and some finetuning we can achive thos with one service

## Install OpenAI library
We will be useing Grok API to query database

In [13]:
!uv pip install openai

Using Python 3.12.3 environment at: /home/hp/Documents/Vscode/gen_ai_students_marksheet/venv
Audited 1 package in 7ms

In [14]:
from openai import OpenAI

# Parse JSON response
import json


GROK_API_KEY = os.getenv("GROK_API_KEY")
# print(f"Grok API Key: {GROK_API_KEY}")


# Initialize Grok API client
# You can use xAI's Grok API through OpenAI-compatible interface
client = OpenAI(
    api_key=GROK_API_KEY,  # Replace with your actual Grok API key
    base_url="https://api.x.ai/v1"
)

In [15]:

# Test prompt to Grok API
# ask question - what is the capital of India?
response = client.chat.completions.create(
    model="grok-4-1-fast-reasoning",  # Use the appropriate Grok model
    messages=[
        {"role": "system", "content": "You are a helpful assistant."},
        {"role": "user", "content": "What is the capital of India?"}  
    ],
    response_format={"type": "json_object"}
)

print(response.choices[0].message.content)

{"answer": "New Delhi"}

### create ```query_database_with_grok``` to get data

In [16]:
# Get database schema information
schema_info = f"""
    Database Schema:

    1. classes table: id, name, status
    2. students table: id, first_name, last_name, gender, dob, age, class_id
    3. subjects table: id, name, class_id, description
    4. test_marks table: id, name, class_id, student_id, subject_id, marks, total_marks

    Relationships:
    - Student belongs to one Class (students.class_id -> classes.id)
    - Subject belongs to one Class (subjects.class_id -> classes.id)
    - TestMarks belongs to Student, Class, and Subject

    """

# Later we will see
custom_instructions = f"""
    Exceptions:
    - When querying subjects: Subject names in the database include the class name as a suffix (e.g., "Math Five", "Physics Six"). If the user asks about a subject with specifying the class use name = '<subject_name> <class_name>' (e.g. incase of class Five query will be WHERE name = 'Math Five'). If the user asks about a subject without specifying the class (e.g`., "Math"), use LIKE pattern matching to find all matching subjects (e.g., WHERE name LIKE 'Math%').

    
    - Always include related data in SELECT: When a query involves relationships (e.g., students and their marks), include relevant fields from all related tables. For example, if asking about "Student with highest marks in Math", return student columns (first_name, last_name, etc.), marks columns (marks, total_marks), and subject columns (subject name) in a single result set using JOINs.
    """


# custom_instructions = f"""
#     Exceptions:
#     - When querying subjects: Subject names in the database include the class name as a suffix (e.g., "Math Five", "Physics Six"). If the user asks about a subject without specifying the class (e.g., "Math"), use LIKE pattern matching to find all matching subjects (e.g., WHERE name LIKE 'Math%').


#     - Always include related data in SELECT: When a query involves relationships (e.g., students and their marks), include relevant fields from all related tables. For example, if asking about "Student with highest marks in Math", return student columns (first_name, last_name, etc.), marks columns (marks, total_marks), and subject columns (subject name) in a single result set using JOINs.

#     """

In [17]:

def query_database_with_grok(client, user_question):
    """
    Use Grok to generate SQL query based on user question and execute it
    """
   
    # Create prompt for Grok
    prompt = f"""
    {schema_info}
    {custom_instructions}
    User Question: {user_question}
    
    Generate a PostgreSQL query to answer this question. Return SQL query, no explanation.
    """
    
    # Call Grok API
    response = client.chat.completions.create(
        model="grok-4-1-fast-reasoning",
        messages=[
            {"role": "system", "content": "You are a SQL expert. Generate only valid PostgreSQL queries. in JSON format with a single key 'query'."},
            {"role": "user", "content": prompt}
        ],
        response_format={"type": "json_object"}
    )
    print(f"Response: {response.choices[0].message.content}\n")

    response_data = json.loads(response.choices[0].message.content)
   # Extract SQL query from JSON
    sql_query = response_data.get('query', '') or response_data.get('sql', '') or str(response_data)
   
    print(f"Generated SQL Query:\n{sql_query}\n")

    # Execute the query
    result_df = pd.read_sql(text(sql_query), engine)
    
    return result_df

### Q1. Profile Information of Student name John and get his study subject and its marks

In [18]:
# Example usage
result = query_database_with_grok(client, "Profile Information of Student name John and get his study subject and its marks")

Response: {"query":"SELECT \n    s.id AS student_id,\n    s.first_name,\n    s.last_name,\n    s.gender,\n    s.dob,\n    s.age,\n    c.id AS class_id,\n    c.name AS class_name,\n    c.status,\n    sub.id AS subject_id,\n    sub.name AS subject_name,\n    sub.description,\n    tm.id AS test_mark_id,\n    tm.name AS test_name,\n    tm.marks,\n    tm.total_marks\nFROM \n    students s\nJOIN \n    classes c ON s.class_id = c.id\nLEFT JOIN \n    subjects sub ON sub.class_id = c.id\nLEFT JOIN \n    test_marks tm ON tm.student_id = s.id \n        AND tm.subject_id = sub.id \n        AND tm.class_id = c.id\nWHERE \n    s.first_name = 'John'\nORDER BY \n    s.id, sub.name, tm.name;"}

Generated SQL Query:
SELECT
    s.id AS student_id,
    s.first_name,
    s.last_name,
    s.gender,
    s.dob,
    s.age,
    c.id AS class_id,
    c.name AS class_name,
    c.status,
    sub.id AS subject_id,
    sub.name AS subject_name,
    sub.description,
    tm.id AS test_mark_id,
    tm.name AS test_name,
    tm.marks,
    tm.total_marks
FROM
    students s
JOIN
    classes c ON s.class_id = c.id
LEFT JOIN
    subjects sub ON sub.class_id = c.id
LEFT JOIN
    test_marks tm ON tm.student_id = s.id
        AND tm.subject_id = sub.id
        AND tm.class_id = c.id
WHERE
    s.first_name = 'John'
ORDER BY
    s.id, sub.name, tm.name;

In [19]:
print(result.to_string(index=False))

 student_id first_name last_name gender        dob  age  class_id class_name status  subject_id   subject_name                      description  test_mark_id      test_name  marks  total_marks
          1       John       Doe      M 2012-05-15   12         1       Five active           4   Biology Five   Biology subject for class Five             4   Biology Five     57          100
          1       John       Doe      M 2012-05-15   12         1       Five active           3 Chemistry Five Chemistry subject for class Five             3 Chemistry Five     90          100
          1       John       Doe      M 2012-05-15   12         1       Five active           5 Geography Five Geography subject for class Five             5 Geography Five     75          100
          1       John       Doe      M 2012-05-15   12         1       Five active           1      Math Five      Math subject for class Five             1      Math Five     86          100
          1       John       Doe      M 2012-05-15   12         1       Five active           2    Physic Five    Physic subject for class Five             2    Physic Five     80          100

### Q2. Fetch Student Profile in class Five who got highest marks in Geography subject

In [20]:
# Example usage
result = query_database_with_grok(client, "Fetch Student Profile in class Five who got highest marks in Geography subject")
print("================================================================================")
print(result.to_string(index=False))
print("================================================================================")

Response: {"query":"SELECT s.first_name, s.last_name, s.gender, s.dob, s.age, c.name AS class_name, tm.marks, tm.total_marks, tm.name AS test_name, sub.name AS subject_name FROM students s JOIN classes c ON s.class_id = c.id JOIN test_marks tm ON s.id = tm.student_id AND tm.class_id = c.id JOIN subjects sub ON tm.subject_id = sub.id AND sub.class_id = c.id WHERE c.name = 'Five' AND sub.name = 'Geography Five' ORDER BY tm.marks DESC LIMIT 1;"}

Generated SQL Query:
SELECT s.first_name, s.last_name, s.gender, s.dob, s.age, c.name AS class_name, tm.marks, tm.total_marks, tm.name AS test_name, sub.name AS subject_name FROM students s JOIN classes c ON s.class_id = c.id JOIN test_marks tm ON s.id = tm.student_id AND tm.class_id = c.id JOIN subjects sub ON tm.subject_id = sub.id AND sub.class_id = c.id WHERE c.name = 'Five' AND sub.name = 'Geography Five' ORDER BY tm.marks DESC LIMIT 1;

================================================================================
first_name last_name gender        dob  age class_name  marks  total_marks      test_name   subject_name
      Ravi     Singh      M 2012-09-05   12       Five     92          100 Geography Five Geography Five
================================================================================

### Q.3 Fetch Student Profile who got highest marks in Math subject

In [21]:
# Example usage
result = query_database_with_grok(client, "Fetch Student Profile who got highest marks in Math subject")
print("================================================================================")
print(result.to_string(index=False))
print("================================================================================")

Response: {"query":"SELECT st.id, st.first_name, st.last_name, st.gender, st.dob, st.age, c.name AS class_name, sub.name AS subject_name, tm.name AS test_name, tm.marks, tm.total_marks FROM students st JOIN classes c ON st.class_id = c.id JOIN test_marks tm ON st.id = tm.student_id AND tm.class_id = st.class_id JOIN subjects sub ON tm.subject_id = sub.id AND sub.class_id = tm.class_id WHERE sub.name LIKE 'Math%' AND tm.marks = (SELECT MAX(tm2.marks) FROM test_marks tm2 JOIN subjects sub2 ON tm2.subject_id = sub2.id WHERE sub2.name LIKE 'Math%') ORDER BY st.last_name, st.first_name;"}

Generated SQL Query:
SELECT st.id, st.first_name, st.last_name, st.gender, st.dob, st.age, c.name AS class_name, sub.name AS subject_name, tm.name AS test_name, tm.marks, tm.total_marks FROM students st JOIN classes c ON st.class_id = c.id JOIN test_marks tm ON st.id = tm.student_id AND tm.class_id = st.class_id JOIN subjects sub ON tm.subject_id = sub.id AND sub.class_id = tm.class_id WHERE sub.name LIKE 'Math%' AND tm.marks = (SELECT MAX(tm2.marks) FROM test_marks tm2 JOIN subjects sub2 ON tm2.subject_id = sub2.id WHERE sub2.name LIKE 'Math%') ORDER BY st.last_name, st.first_name;

================================================================================
 id first_name last_name gender        dob  age class_name subject_name test_name  marks  total_marks
 15      Meena     Joshi      F 2011-12-02   13        Six     Math Six  Math Six     98          100
================================================================================

### Q.4 Fetch Top 3 Student Profile who got highest marks in Math subject, including their class and subject details like marks and total marks

In [22]:
# Example usage
result = query_database_with_grok(client, "Fetch Top 3 Student Profile who got highest marks in Geography subject, including their class and subject details like marks and total marks")
print("===================================================================================================================")
print(result.to_string(index=False))
print("===================================================================================================================")

Response: {"query":"SELECT first_name, last_name, gender, dob, age, class_name, subject_name, marks, total_marks FROM ( SELECT s.first_name, s.last_name, s.gender, s.dob, s.age, c.name AS class_name, sub.name AS subject_name, tm.marks, tm.total_marks, ROW_NUMBER() OVER (PARTITION BY s.id ORDER BY tm.marks DESC) AS rn FROM students s JOIN classes c ON c.id = s.class_id JOIN test_marks tm ON tm.student_id = s.id JOIN subjects sub ON sub.id = tm.subject_id WHERE sub.name LIKE 'Geography%' ) t WHERE rn = 1 ORDER BY marks DESC LIMIT 3;"}

Generated SQL Query:
SELECT first_name, last_name, gender, dob, age, class_name, subject_name, marks, total_marks FROM ( SELECT s.first_name, s.last_name, s.gender, s.dob, s.age, c.name AS class_name, sub.name AS subject_name, tm.marks, tm.total_marks, ROW_NUMBER() OVER (PARTITION BY s.id ORDER BY tm.marks DESC) AS rn FROM students s JOIN classes c ON c.id = s.class_id JOIN test_marks tm ON tm.student_id = s.id JOIN subjects sub ON sub.id = tm.subject_id WHERE sub.name LIKE 'Geography%' ) t WHERE rn = 1 ORDER BY marks DESC LIMIT 3;

===================================================================================================================
first_name last_name gender        dob  age class_name    subject_name  marks  total_marks
    Nikhil   Agarwal      M 2010-06-06   14      Seven Geography Seven     98          100
     Sneha     Desai      F 2010-09-27   14      Seven Geography Seven     98          100
      Ravi     Singh      M 2012-09-05   12       Five  Geography Five     92          100
===================================================================================================================

### create ```updateDatabaseWithGrok``` function to update data

In [23]:
def update_database_with_grok(client, user_question):
    """
    Use Grok to generate SQL query based on user question and execute it
    """
    # Create prompt for Grok
    prompt = f"""
    {schema_info}
    {custom_instructions}
    User Question: {user_question}
    
    Generate a PostgreSQL query to answer this question. Return SQL query, no explanation.
    """
    
    # Call Grok API
    response = client.chat.completions.create(
        model="grok-4-1-fast-reasoning",
        messages=[
            {"role": "system", "content": "You are a SQL expert. Generate only valid PostgreSQL queries."},
            {"role": "user", "content": prompt}
        ],
        response_format={"type": "json_object"}
    )
    response_data = json.loads(response.choices[0].message.content)
    # Extract SQL query from JSON
    sql_query = response_data.get('query', '') or response_data.get('sql', '') or str(response_data)
   
    print(f"Generated SQL Query:\n{sql_query}\n")

    # Check if it's a SELECT query or modification query
    sql_upper = sql_query.strip().upper()
    
    if sql_upper.startswith('SELECT'):
        # Execute SELECT query and return DataFrame
        result_df = pd.read_sql(text(sql_query), engine)
        return result_df
    else:
        # Execute UPDATE/INSERT/DELETE query
        with engine.connect() as conn:
            result = conn.execute(text(sql_query))
            conn.commit()
            print(f"Query executed successfully. Rows affected: {result.rowcount}")
        # Return empty DataFrame with status message
        return pd.DataFrame({'status': ['success'], 'rows_affected': [result.rowcount]})

### Q.5 Update John's test marks to 88 in Math subject

In [25]:
result = update_database_with_grok(client, "Get John's test marks in Math subject")
print("===================================================================================================================")
print(result.to_string(index=False))
print("===================================================================================================================")

Generated SQL Query:
SELECT s.first_name, s.last_name, s.gender, s.dob, s.age, c.name AS class_name, tm.name AS test_name, sub.name AS subject_name, tm.marks, tm.total_marks FROM students s JOIN classes c ON c.id = s.class_id JOIN test_marks tm ON tm.student_id = s.id AND tm.class_id = s.class_id JOIN subjects sub ON sub.id = tm.subject_id AND sub.class_id = tm.class_id WHERE s.first_name = 'John' AND sub.name LIKE 'Math%';

===================================================================================================================
first_name last_name gender        dob  age class_name test_name subject_name  marks  total_marks
      John       Doe      M 2012-05-15   12       Five Math Five    Math Five     86          100
===================================================================================================================

In [26]:
# Example usage
result = update_database_with_grok(client, "Update John's test marks to 88 in Math subject")
print("===================================================================================================================")
print(result.to_string(index=False))
print("===================================================================================================================")

Generated SQL Query:
UPDATE test_marks tm SET marks = 88 FROM students s, subjects sub WHERE tm.student_id = s.id AND s.first_name = 'John' AND tm.subject_id = sub.id AND sub.name LIKE 'Math%' AND tm.class_id = s.class_id AND tm.class_id = sub.class_id;

Query executed successfully. Rows affected: 1
===================================================================================================================
 status  rows_affected
success              1
===================================================================================================================

In [27]:
result = update_database_with_grok(client, "Get John's test marks in Math subject")
print("===================================================================================================================")
print(result.to_string(index=False))
print("===================================================================================================================")

Generated SQL Query:
SELECT s.first_name, s.last_name, s.gender, s.dob, s.age, c.name AS class_name, sub.name AS subject_name, tm.name AS test_name, tm.marks, tm.total_marks FROM students s JOIN classes c ON s.class_id = c.id JOIN test_marks tm ON tm.student_id = s.id AND tm.class_id = s.class_id JOIN subjects sub ON tm.subject_id = sub.id AND sub.class_id = s.class_id WHERE s.first_name = 'John' AND sub.name LIKE 'Math%';

===================================================================================================================
first_name last_name gender        dob  age class_name subject_name test_name  marks  total_marks
      John       Doe      M 2012-05-15   12       Five    Math Five Math Five     88          100
===================================================================================================================

## Gradio UI

In [28]:
!uv pip install gradio tabulate

Using Python 3.12.3 environment at: /home/hp/Documents/Vscode/gen_ai_students_marksheet/venv
Audited 2 packages in 17ms

In [29]:
import gradio as gr

def handle_query(messages, user_question):
    try:
        result_df = query_database_with_grok(client, user_question)
        if result_df.empty:
            answer = "No results found."
        else:
            answer = result_df.to_markdown(index=False)
    except Exception as e:
        answer = f"Error: {e}"
    # Append user and assistant messages as dicts
    messages = messages + [
        {"role": "user", "content": user_question},
        {"role": "assistant", "content": answer}
    ]
    return messages


with gr.Blocks(title="GenAI Student-Class-Subject-TestMarks Chat") as demo:
    with gr.Row():
        with gr.Column():
            gr.Markdown("## GenAI Chat (Query & Update)\nAsk questions about students, classes, subjects, or test marks.")
            chatbot = gr.Chatbot()
            query_input = gr.Textbox(label="Ask a question (e.g., 'Show all students in class Five')")
            query_btn = gr.Button("Submit Query")
            query_btn.click(
                fn=handle_query,
                inputs=[chatbot, query_input],
                outputs=chatbot
            )

demo.launch()

/home/hp/Documents/Vscode/gen_ai_students_marksheet/venv/lib/python3.12/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

* Running on local URL:  http://127.0.0.1:7860
* To create a public link, set `share=True` in `launch()`.

Response: {"query":"SELECT s.first_name, s.last_name, s.gender, s.dob, s.age, c.name AS class_name, subj.name AS subject_name, subj.description, tm.name AS test_name, tm.marks, tm.total_marks FROM test_marks tm JOIN students s ON tm.student_id = s.id JOIN subjects subj ON tm.subject_id = subj.id JOIN classes c ON s.class_id = c.id WHERE subj.name LIKE 'Math%' ORDER BY tm.marks DESC LIMIT 3;"}

Generated SQL Query:
SELECT s.first_name, s.last_name, s.gender, s.dob, s.age, c.name AS class_name, subj.name AS subject_name, subj.description, tm.name AS test_name, tm.marks, tm.total_marks FROM test_marks tm JOIN students s ON tm.student_id = s.id JOIN subjects subj ON tm.subject_id = subj.id JOIN classes c ON s.class_id = c.id WHERE subj.name LIKE 'Math%' ORDER BY tm.marks DESC LIMIT 3;